scripts/mtp_pruning/results-8k/mtp-on/input-8192/c4/run-2.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xed0258e41c60>, trust_remote_code=False, seed=0, num_prompts=4, dataset_name='custom', no_stream=False, dataset_path='/home/cc2869/research/magpie/magpie-spark-vllm/scripts/mtp_pruning/results-8k/datasets/input-8192.jsonl', no_oversample=False, skip_chat_template=True, enable_multimodal_chat=False, disable_shuffle=True, custom_output_len=512, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=4, model='Qwen/Qwen3.8-27B', input_len=None, output_len=None, tokenizer='/home/cc2869/models/Qwen3.8-27B-NVFP4', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=True, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/home/cc2869/research/magpie/magpie-spark-vllm/scripts/mtp_pruning/results-8k/mtp-on/input-8192/c4', result_filename='run-2.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-6f6a60d7-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 4
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     4         
Failed requests:                         0         
Maximum request concurrency:             4         
Benchmark duration (s):                  40.27     
Total input tokens:                      32768     
Total generated tokens:                  2048      
Request throughput (req/s):              0.10      
Output token throughput (tok/s):         50.86     
Peak output token throughput (tok/s):    28.00     
Peak concurrent requests:                4.00      
Total token throughput (tok/s):          864.64    
---------------Time to First Token----------------
Mean TTFT (ms):                          11225.69  
Median TTFT (ms):                        11356.31  
P50 TTFT (ms):                           11356.31  
P90 TTFT (ms):                           16318.84  
P99 TTFT (ms):                           17373.30  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          55.15     
Median TPOT (ms):                        54.13     
P50 TPOT (ms):                           54.13     
P90 TPOT (ms):                           64.57     
P99 TPOT (ms):                           67.45     
---------------Inter-token Latency----------------
Mean ITL (ms):                           203.11    
Median ITL (ms):                         169.59    
P50 ITL (ms):                            169.59    
P90 ITL (ms):                            171.64    
P99 ITL (ms):                            1056.66   
----------------End-to-end Latency----------------
Mean E2EL (ms):                          39406.94  
Median E2EL (ms):                        39528.19  
P50 E2EL (ms):                           39528.19  
P90 E2EL (ms):                           40104.25  
P99 E2EL (ms):                           40249.60  
---------------Speculative Decoding---------------
Acceptance rate (%):                     91.13     
Acceptance length:                       3.71      
Drafts:                                  550       
Draft tokens:                            1634      
Accepted tokens:                         1489      
Per-position acceptance (%):
  Position 0:                            91.09     
  Position 1:                            90.00     
  Position 2:                            89.64     
==================================================